{
    "app": {
        "parameters": {
            "groups": {
                "label": "Auto-Assign Groups",
                "helpText": "Comma-separated list of group names and/or ids that will auto-assign a ticket when viewed by an agent."
            },
            "exactmatch": {
                "label": "Match user groups exactly",
                "helpText": "If true, tickets will only auto-assign if the ticket group matches the user's one and only group. (This is helpful if you're installing the app for one user group.)"
            },
            "matchall": {
                "label": "Match all user groups",
                "helpText": "If true, tickets will only auto-assign if all of the user's groups are in Auto-Assign Groups above. (Useful to avoid assigning tickets to non-agent users such as QA or Training.)"
            },
            "runonall": {
                "label": "Run auto-assign for all groups",
                "helpText": "If true, the app will run on all tickets. Use the below role/group restrictions to control which users are effected. (This setting will prevent 'Match all user groups' from working properly.)"
            }
        },
        "name": "Auto-Assigner",
        "short_description": "Assigns tickets to viewing user if ticket and user have same group.",
        "long_description": "Zendesk's Guided Mode is a fantastic means of delivering work to agents. But if your agents do a lot of work *outside* of Zendesk, the tickets they're viewing will be sent to another agent automatically.\nFor companies and teams with sophisticated workflows this can lead to tickets being sent to multiple agents at a time.\n\nThis app solves that problem by assigning the ticket directly to the agent on view. No more duplication of effort!\nSimply set which Ticket Groups should be auto-assigned and the app will do the rest. As soon as an agent in that group views a ticket from that group, it will assign to them.\nIf you like this app, but it is missing a feature critical to your workflow: [Let us know!](https://d3v-3sigma.zendesk.com/hc/en-us/requests/new?ticket_form_id=13806449792525)",
        "installation_instructions": "**Note**: You need administrator permissions in Zendesk to set up the app.\n * Click the Install button above on this page. \n * Set up the app configuration according to your needs. \n * That's it! You're ready to start saving clicks.\n        \n\n---------------------------------------"
    },
    "default": {
        "report_bugs": "Report Issues",
        "load_location_error": "Autoassign App loaded from bad location - ",
        "ticket_not_assigned": "Ticket not auto-assigned: ",
        "non_agent_status": "The ticket is not in an agent-active status.",
        "ticket_already_assigned": "The ticket is already assigned; we are not updating the assignee.",
        "non_aa_ticket_group": "The ticket does not belong to an auto-assigned group.",
        "group_does_not_match": "The ticket group is not in the user's group(s).",
        "non_aa_user_groups": "The user does not belong to any auto-assigned groups.",
        "non_aa_user_groups_exact": "The user belongs to at least one group that is not auto-assigned.",
        "too_many_user_groups": "The user belongs to more than one user group.",
        "ticket_unsuccessfully_assigned": "There was an erorr when attempting to auto-assign the ticket.",
        "ticket_successfully_assigned": "The ticket was successfully auto-assigned.",
        "ticket_assigned_notification": "The ticket has been auto-assigned."
    }
}